/*******************************************************
题目:
	挑7
描述: 	
	输出7有关数字的个数，包括7的倍数，还有包含7的数字（如17，27，37...70，71，72，73...）的个数
输入:	 
	一个正整数N。(N不大于30000)
输出:	 
	不大于N的与7有关的数字个数，例如输入20，与7有关的数字包括7,14,17.
*******************************************************/
//暂时没有想到好的算法

#include<iostream>
using namespace std;

int main() {
	int N;
	cin >> N;

	int count = 0;
	for(int i = 1; i <= N; i++) {
		if(i % 7 == 0){
			count++;
			continue;
		}
		if(i % 10 == 7 || i/10 %10 == 7 || i/100 %10 == 7 || i/1000 %10 == 7)
			count++;
	}
	cout << count;
	return 0;
}
